Revit 2027 API
BuiltInFailures.PipingFailures.InvalidPipeSize Property
 Pipe Size Table "[File Name]" is missing or invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidPipeSize { get; }
Public Shared ReadOnly Property InvalidPipeSize As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidPipeSize {
	FailureDefinitionId^ get ();
}
static member InvalidPipeSize : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PipingFailures Class
Autodesk.Revit.DB Namespace